Revit 2027 API
BeamSystem.Profile Property
Retrieve or set the profile of the BeamSystem.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CurveArray Profile { get; set; }
Public Property Profile As CurveArray
	Get
	Set
public:
property CurveArray^ Profile {
	CurveArray^ get ();
	void set (CurveArray^ value);
}
member Profile : CurveArray with get, set
Property Value
CurveArray
See Also
Reference
BeamSystem Class
Autodesk.Revit.DB Namespace